---
kind: type
id: T:Autodesk.Revit.DB.RoutingPreferenceErrorLevel
source: html/37b1540d-5fe8-7666-b284-4f8d11c14f45.htm
---
# Autodesk.Revit.DB.RoutingPreferenceErrorLevel

An enumerated type listing the options for posting errors or warnings when routing preferences are not satisfied.

## Syntax (C#)
```csharp
public enum RoutingPreferenceErrorLevel
```